package pe.student;

import javax.swing.*;
import java.awt.*;

public class School_announcement extends JPanel{
	/**
	 * 
	 */
	private static final long serialVersionUID = 1L;
	private JLabel test=new JLabel("学校公告");
	private JPanel p = new JPanel();
	private JTextArea t = new JTextArea("关于校内禁行电动车、摩托车的通知\n" +
			"各单位：\n" +
			"\n" +
			"为解决校内电动车、摩托车乱停乱放、超速行驶等交通安全隐患问题，营造和谐有序、安全文明的校园育人环境，经学校文明校园建设系列专题会议研究决定，自2021年12月12日起，在学校明伦校区、金明校区内禁行电动车、摩托车，校内设置临时集中停车区，对入校车辆进行统一管理。具体安排如下：\n" +
			"\n" +
			"一、临时集中停车区地点\n" +
			"\n" +
			"（一）明伦校区\n" +
			"\n" +
			"1．东操场西侧南北路上（靠路东侧停放）。从南大门进校后右转，直行100米左转即到；从东大门直行至法学院左转即到。\n" +
			"\n" +
			"2．十号楼前人行道南侧——老图书馆后墙区域。从西大门进校直行至十号楼即到。\n" +
			"\n" +
			"（二）金明校区\n" +
			"\n" +
			"1．校医院大楼西侧路上和北侧环形空地。开放小西门，从小西门进门右转即到。\n" +
			"\n" +
			"2．志义体育场门前广场。开放东大门，从东大门进校100米右转即到。（7号楼东侧树下停车场作为备用区）\n" +
			"\n" +
			"3．校北大门、西大门、21号院北门禁止电动车、摩托车进校。\n" +
			"\n" +
			"二、车辆管理\n" +
			"\n" +
			"1．进入学校的电动车、摩托车须停放在临时集中停车区，禁止在校区内随意骑行。\n" +
			"\n" +
			"2．校区内住宿师生的电动车、摩托车存放在就近临时集中停车区，禁止在校区内随意骑行。\n" +
			"\n" +
			"3．对工勤人员、身体有特殊情况者的相关车辆进行分类管理。各单位汇总相关信息，向保卫处提出申请；保卫处为车辆办理相关证件和标识，车辆方可通行。\n" +
			"\n" +
			"4. 逐步移除校内充电桩，尽可能减少安全隐患。\n" +
			"\n" +
			"5. 倡导“绿色、低碳、安全、健康”出行，每天步行一万步,健康工作五十年,幸福生活一辈子。\n" +
			"\n" +
			"三、监督考核\n" +
			"\n" +
			"1. 对于不按规定在校园内骑行，或在校园内乱停乱放车辆者，保卫处将对其本人进行批评教育；相关车辆将被列入黑名单，不允许再进入学校。\n" +
			"\n" +
			"2. 各单位要密切关注校内交通安全和师生诉求，畅通师生意见反馈渠道，一切为了师生，一切服务师生。师生对校园安全和育人环境满意度将被作为重要参考内容，纳入学校对各单位文明创建工作的考核指标体系。\n" +
			"\n" +
			"校文明委【2021】1号关于校内禁行电动车、摩托车的通知.pdf\n" +
			"\n" +
			"河南大学精神文明建设委员会\n" +
			"\n" +
			"2021年12月10日");
	public School_announcement(){
		test.setFont(new Font("宋体",Font.BOLD,50));
		this.add(test, BorderLayout.CENTER);
		this.setVisible(true);
		this.setBackground(Color.white);
		p.add(t);
		this.add(p);
	}
	
	public JPanel view(){
		return this;
	}
}
